IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/TOP_EFUSE_FARM_TOP_EFUSE_FARM.xml
<module name="TOP_EFUSE_FARM_TOP_EFUSE_FARM" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="TOP_EFUSE_FARM_INSTRUCTION" acronym="TOP_EFUSE_FARM_INSTRUCTION" offset="0x0" width="32" description="">
		<bitfield id="HOLDECI" width="5" begin="28" end="24" resetval="0x0" description="Holds the eFuse controller instruction." range="28 - 24" rwaccess="RW"/> 
		<bitfield id="ADDHOLDDWI" width="16" begin="15" end="0" resetval="0x0" description="Holds the address to use for the DumpWord instruction. All other instructions ignore these bits." range="15 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_ADDRESS" acronym="TOP_EFUSE_FARM_ADDRESS" offset="0x4" width="32" description="">
		<bitfield id="NU1" width="16" begin="31" end="16" resetval="0x0" description="Not used" range="31 - 16" rwaccess="RO"/> 
		<bitfield id="BLOCKSEL" width="5" begin="15" end="11" resetval="0x0" description="FuseROM block select. These five bits select which of the 32 possible FuseROMs is used in the following instruction." range="15 - 11" rwaccess="RW"/> 
		<bitfield id="ROW" width="11" begin="10" end="0" resetval="0x0" description="FuseROM row address. Given the FuseROM selected by the FuseROM block select, these 11 bits select which row of the FuseROM is used in the following instruction. Since the maximum number of rows for a FuseROM is 64, only bits [5:0]  of the FuseROM row address should be used. Address bits [10:6]  should be set low ('0')" range="10 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_DATAREGISTERUPPER" acronym="TOP_EFUSE_FARM_DATAREGISTERUPPER" offset="0x8" width="32" description="">
		<bitfield id="NU1" width="29" begin="31" end="3" resetval="0x0" description="Not used" range="31 - 3" rwaccess="RO"/> 
		<bitfield id="WRITEPROTECT" width="1" begin="2" end="2" resetval="0x0" description="Write protect (WP). Once this bit is set high ('1') in any FuseROM row, the other bits in that FuseROM row can no longer be programmed." range="2" rwaccess="RW"/> 
		<bitfield id="READPROTECT" width="1" begin="1" end="1" resetval="0x0" description="Read protect (RP). Once this bit is set high ('1') in any FuseROM row, a DumpWord instruction returns all zeros (00000000H). The actual data in bits [31:0]  of that row will still be loaded into the fuse scan chain during an autoload operation." range="1" rwaccess="RW"/> 
		<bitfield id="REDUNDANTROW" width="1" begin="0" end="0" resetval="0x0" description="row 0 -    Not used  row 1 - 63 Redundant (R). Once this bit is set high (?1?), the row is marked as having a failure and is replaced by a redundant row." range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_DATAREGISTERLOWER" acronym="TOP_EFUSE_FARM_DATAREGISTERLOWER" offset="0xC" width="32" description="">
		<bitfield id="DISABLELOADFUSESCAN" width="1" begin="31" end="31" resetval="0x0" description="Disable LoadFuseScanChain. If this bit is programmed, the LoadFuseScanChain operation (also called soft load operation) is disabled." range="31" rwaccess="RW"/> 
		<bitfield id="NU1" width="23" begin="29" end="7" resetval="0x0" description="Not used" range="29 - 7" rwaccess="RO"/> 
		<bitfield id="REDUNDANCYENABLE" width="1" begin="6" end="6" resetval="0x0" description="Redundancy enable. If a redundant row address is programmed in bits[5:0], this bit must be programmed." range="6" rwaccess="RW"/> 
		<bitfield id="REDUNDANTROW" width="6" begin="5" end="0" resetval="0x0" description="Redundant row address. These six bits contain the address of a failing row that will be replaced by the native redundant row physically located at the bottom of FuseROM array." range="5 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_SYSTEMCONFIG" acronym="TOP_EFUSE_FARM_SYSTEMCONFIG" offset="0x10" width="32" description="">
		<bitfield id="PWRMGMTCTRL" width="2" begin="13" end="12" resetval="0x0" description="Master interface power management control" range="13 - 12" rwaccess="RW"/> 
		<bitfield id="CLKCTL" width="4" begin="11" end="8" resetval="0x0" description="Control of clock internal gating while module is idle. There is one bit per clock. The actual register width depends on the number of functional clocks controlled." range="11 - 8" rwaccess="RW"/> 
		<bitfield id="REACTION" width="1" begin="6" end="6" resetval="0x0" description="Reaction to module suspend assertion (for emulation). There is no effect if bit[5]=1." range="6" rwaccess="RW"/> 
		<bitfield id="SENSITIVITY" width="1" begin="5" end="5" resetval="0x0" description="Sensitivity to module suspend (for emulation)." range="5" rwaccess="RW"/> 
		<bitfield id="IDLEREQACK" width="2" begin="4" end="3" resetval="0x2" description="Slave interface power management control. Idle request/acknowledge control." range="4 - 3" rwaccess="RW"/> 
		<bitfield id="WAKEUPGENCTL" width="1" begin="2" end="2" resetval="0x0" description="Asynchronous wake-up generation control" range="2" rwaccess="RW"/> 
		<bitfield id="SWRESET" width="1" begin="1" end="1" resetval="0x0" description="Module software reset" range="1" rwaccess="RW"/> 
		<bitfield id="INTAUTOGATECTL" width="1" begin="0" end="0" resetval="0x1" description="Internal autogating control." range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_SYSTEMSTATUS" acronym="TOP_EFUSE_FARM_SYSTEMSTATUS" offset="0x14" width="32" description="">
		<bitfield id="RESETDONE" width="1" begin="0" end="0" resetval="0x1" description="Reset done." range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_ACCUMULATOR" acronym="TOP_EFUSE_FARM_ACCUMULATOR" offset="0x18" width="32" description="">
		<bitfield id="NU1" width="8" begin="31" end="24" resetval="0x0" description="Not used" range="31 - 24" rwaccess="RO"/> 
		<bitfield id="ACCUMULATOR" width="24" begin="23" end="0" resetval="0x0" description="Accumulator. These bits hold data after the execution of various instructions." range="23 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_BOUNDARY" acronym="TOP_EFUSE_FARM_BOUNDARY" offset="0x1C" width="32" description="">
		<bitfield id="NU2" width="10" begin="31" end="22" resetval="0x0" description="Not used" range="31 - 22" rwaccess="RO"/> 
		<bitfield id="DSIABLERDROW" width="1" begin="21" end="21" resetval="0x0" description="Disable read row 0. When high, disables read of row 0 during initial access of FuseROM." range="21" rwaccess="RW"/> 
		<bitfield id="NU1" width="12" begin="20" end="9" resetval="0x0" description="Not used" range="20 - 9" rwaccess="RO"/> 
		<bitfield id="EFCFDI" width="1" begin="8" end="8" resetval="0x0" description="EFC_FDI. This bit drives the EFC_FDI input when enable is set." range="8" rwaccess="RW"/> 
		<bitfield id="SYSDIEDAUTOLOADEN" width="1" begin="7" end="7" resetval="0x0" description="SYS_DIEID_AUTOLOAD_EN. This bit drives the SYS_DIEID_AUTOLOAD_EN input when enable is set." range="7" rwaccess="RW"/> 
		<bitfield id="SYSREPAIREN" width="2" begin="6" end="5" resetval="0x0" description="SYS_REPAIR_EN[1:0]. This bus sets the SYS_REPAIR_EN inputs when enable is set." range="6 - 5" rwaccess="RW"/> 
		<bitfield id="SYSWSREADSTATES" width="4" begin="4" end="1" resetval="0x0" description="SYS_WS_READ_STATES[3:0]. These bits drive the SYS_WS_READ_STATES inputs when enable is set." range="4 - 1" rwaccess="RW"/> 
		<bitfield id="ENABLE" width="1" begin="0" end="0" resetval="0x0" description="Enable. This bit is used to control whether the input ports or the boundary register drives the inputs. If set high (?1?), the inputs to the controller are driven by the values of the boundary register." range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_KEYFLAG" acronym="TOP_EFUSE_FARM_KEYFLAG" offset="0x20" width="32" description="">
		<bitfield id="NU1" width="31" begin="31" end="1" resetval="0x0" description="Not used" range="31 - 1" rwaccess="RO"/> 
		<bitfield id="KEYFLAG" width="1" begin="0" end="0" resetval="0x0" description="Key flag. If the proper key is loaded into the key code bits, this bit will read a 1." range="0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_KEY" acronym="TOP_EFUSE_FARM_KEY" offset="0x24" width="32" description="">
		<bitfield id="KEYCODE" width="32" begin="31" end="0" resetval="0x0" description="Key code. These 32 bits are used to set the key (96969696h) for the program instruction." range="31 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_RELEASE" acronym="TOP_EFUSE_FARM_RELEASE" offset="0x28" width="32" description="">
		<bitfield id="YEARODP" width="7" begin="31" end="25" resetval="0x0" description="Release code indicating year of ODP controller macro release." range="31 - 25" rwaccess="RW"/> 
		<bitfield id="MONTHODP" width="4" begin="24" end="21" resetval="0x0" description="Release code indicating month of ODP controller macro release." range="24 - 21" rwaccess="RW"/> 
		<bitfield id="DAYODP" width="5" begin="20" end="16" resetval="0x0" description="Release code indicating day of ODP controller macro release." range="20 - 16" rwaccess="RW"/> 
		<bitfield id="YEAREFUSE" width="7" begin="15" end="9" resetval="0x7" description="Release code indicating year of eFuse controller macro release." range="15 - 9" rwaccess="RW"/> 
		<bitfield id="MONTHEFUSE" width="4" begin="8" end="5" resetval="0x1" description="Release code indicating month of eFuse controller macro release." range="8 - 5" rwaccess="RW"/> 
		<bitfield id="DAYEFUSE" width="5" begin="4" end="0" resetval="0x5" description="Release code indicating day of eFuse controller macro release." range="4 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_PINS" acronym="TOP_EFUSE_FARM_PINS" offset="0x2C" width="32" description="">
		<bitfield id="NU1" width="23" begin="31" end="9" resetval="0x64" description="Not used" range="31 - 9" rwaccess="RO"/> 
		<bitfield id="EFCREADY" width="1" begin="8" end="8" resetval="0x0" description="EFC_READY. Output pin." range="8" rwaccess="RW"/> 
		<bitfield id="EFCFCLRZ" width="1" begin="7" end="7" resetval="0x1" description="EFC_FCLRZ. Output pin." range="7" rwaccess="RW"/> 
		<bitfield id="SYSDIEDAUTOLOADEN" width="1" begin="6" end="6" resetval="0x0" description="SYS_DIEID_AUTOLOAD_EN. Input pin." range="6" rwaccess="RW"/> 
		<bitfield id="SYSREPAIREN" width="2" begin="5" end="4" resetval="0x0" description="SYS_REPAIR_EN[1:0]. Input pins." range="5 - 4" rwaccess="RW"/> 
		<bitfield id="SYSWSREADSTATES" width="4" begin="3" end="0" resetval="0x7" description="SYS_WS_READ_STATES[3:0]. Input pin." range="3 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_CRA" acronym="TOP_EFUSE_FARM_CRA" offset="0x30" width="32" description="">
		<bitfield id="NU1" width="26" begin="31" end="6" resetval="0x0" description="Not used" range="31 - 6" rwaccess="RO"/> 
		<bitfield id="DATA" width="6" begin="5" end="0" resetval="0x0" description="Data bits to be programmed into the CRA bits of the addressed row" range="5 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_READ" acronym="TOP_EFUSE_FARM_READ" offset="0x34" width="32" description="">
		<bitfield id="NU2" width="24" begin="31" end="8" resetval="0x0" description="Not used" range="31 - 8" rwaccess="RO"/> 
		<bitfield id="READCLKPULSEWIDTH" width="4" begin="7" end="4" resetval="0x0" description="ROM clock read pulse width. Active high. Specifies the number of internal clock cycles that the FuseROM clock (pin FROM_CLK) is high ('1'). These bits override the SYS_WS_READ_STATE[3:0] ports. Values are: Bit Width (4b'0000) 1 * SYS_CLK period (4b'0001) 1 * SYS_CLK period (4b'0010) 2 * SYS_CLK period (4b'0011) 3 * SYS_CLK period (4b'0100) 4 * SYS_CLK period (4b?0101) 5 * SYS_CLK period (4b?0110) - (4b?1111) Not used" range="7 - 4" rwaccess="RW"/> 
		<bitfield id="NU1" width="1" begin="3" end="3" resetval="0x0" description="Reserved for FuseROM testing and debugging." range="3" rwaccess="RO"/> 
		<bitfield id="READDATABIT" width="1" begin="2" end="2" resetval="0x0" description="Read data bit. If the read protect (RP) bit is set in any row, only RP and the write protect (WP) bit are reported during a read, and the other bits are zero. If the RP bit is not set, and the repair (R) bit is set:  If read register[2] = 0 (default), then a read command reads data from the redundant repair row. . If read register[2] = 1, then a read command reads data from the original address row." range="2" rwaccess="RW"/> 
		<bitfield id="COMBINEDMARGIN" width="2" begin="1" end="0" resetval="0x0" description="Combined margin. The bits set the sense amp margin limits according to the following table. The FuseROM Compiler section in the GS60 Customer In-field Programmable FuseROM specification shows more information on combined margin. Margin(1:0) Trip Point Label Description 00 5K Normal Normal read 01 2K Margin 0 Margin test for unblown fuses. An unblown fuse should have a resistance below the trip point. 10 22K Margin 1A Margin test for blown fuses. Higher compare resistance than normal. 11 60K Margin 1B Margin test for blown fuses. Higher margin resistance than normal or Margin 1A." range="1 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_PROGRAM" acronym="TOP_EFUSE_FARM_PROGRAM" offset="0x38" width="32" description="">
		<bitfield id="NU1" width="1" begin="31" end="31" resetval="0x0" description="Not used" range="31" rwaccess="RO"/> 
		<bitfield id="CMPDISABLE" width="1" begin="30" end="30" resetval="0x0" description="Compare disable. Before any FuseROM bit is actually blown, the value of the data register is compared to the FuseROM data bits in the row selected by the address register. If the data register is already equal to the FuseROM row data, the row is not blown, and the program instruction is aborted. Error code 5b 01101 (for more information, see FuseFarm error codes) is placed on EFC_ERROR ports. To avoid this and force the program instruction to continue, set this bit to 1." range="30" rwaccess="RW"/> 
		<bitfield id="CLKSTALLPULSEWIDTH" width="16" begin="29" end="14" resetval="0x0" description="16-bit FuseROM clock stall pulse width. Active low. After the controller attempts to program the data register value into the FuseROM row selected by the address register, the FROM_CLK signal is held low (?0?) for a specified number of internal clock cycles to separate each pass of the controller. These bits determine the number of clock cycles that the controller pauses between each sweep of the FuseROM row." range="29 - 14" rwaccess="RW"/> 
		<bitfield id="SHORTSWITCH" width="1" begin="13" end="13" resetval="0x0" description="Program signal for FuseROM VPP-to-VDD shorting switch. This bit must be set high before executing the program instruction and low after program is completed. The eFuse controller output FROM_ENSW is created from this signal. The FROM_ENSW signal is used to disable (?1?) and enable (?0?) the FuseROM VPP-to-VDD shorting switch during program operation." range="13" rwaccess="RW"/> 
		<bitfield id="WRITEITERATION" width="4" begin="12" end="9" resetval="0x0" description="4-bit maximum write iterations. This register sets the maximum number of sweeps that the program instruction uses to make the FuseROM row equal to the value in the data register. If the eFuse controller sweeps the number of times set in the maximum write iterations bits, an error code (5b?00111 or 5b?01000) is reported ((for more information, see FuseFarm error codes), and the program instruction sets the EFC_READY port high (?1?) and JTAG_TDO high (?1?) for one clock cycle." range="12 - 9" rwaccess="RW"/> 
		<bitfield id="WRITECLKPULSEWIDTH" width="9" begin="8" end="0" resetval="0x0" description="9-bit FuseROM clock write pulse width. Active low. These bits determine the width of the write phase (i.e., FROM_CLK = '0') of the FROM_CLK signal. In most instances, the width of the FROM_CLK write phase relative to the internal clock is simply equal to the unsigned decimal equivalent of the binary code. However, when this value is less than or equal to one, the following table should be used: Read pulse width Write pulse width FROM_CLK == '0' FROM_CLK == '1' 000 000000000 raw raw 000 000000001 1 1 001 000000000 1 1 001 000000001 1 1" range="8 - 0" rwaccess="RW"/>
	</register>
	<register id="TOP_EFUSE_FARM_ERROR" acronym="TOP_EFUSE_FARM_ERROR" offset="0x3C" width="32" description="">
		<bitfield id="NU1" width="26" begin="31" end="6" resetval="0x0" description="Not used" range="31 - 6" rwaccess="RO"/> 
		<bitfield id="INSTRUCTIONDONE" width="1" begin="5" end="5" resetval="0x0" description="Instruction done. Set after each instruction is done. Should be cleared by the interfaces." range="5" rwaccess="RW"/> 
		<bitfield id="STATUSCODE" width="5" begin="4" end="0" resetval="0x0" description="Error/Status code. These five bits hold the error or status code that was returned by the instruction that was executed." range="4 - 0" rwaccess="RW"/>
	</register>
</module>